// (A) Създайте клас CarPart, описващ част за кола.

// Всяка част за кола има:

// идентификатор - уникално число > 0
// име на производител
// описание
// (B) Майсторът в момента главно се интересува от двигатели, гуми и акумулатори.

// Гумите имат:

// широчина в мм – между 155 и 365;
// профил – между 30 и 80;
// диаметър в инчове – между 13 и 21.
// Двигателите се характеризират с конски сили.

// Акумулаторите имат:

// капацитет – в ампер-часове;
// batteryId – идентификатор, независим от този за всяка част (низ с произволна дължина)
// Реализирайте подходящи класове за различните части.

// Създайте и подходящи оператори <<, които да извеждат информация за част в следния формат:
#include <iostream>
#include "exercise_05_engine.h"
#include "exercise_05_wheel.h"
#include "exercise_05_accumulator.h"

int main() {
    Engine engine("Toyota", "V6 petrol engine", 280.0f);
    Wheel wheel("Michelin", "Summer tyre", 225.0f, 45.0f, 17.0f);
    Accumulator accumulator("Bosch", "Lead-acid battery", 60.0f, "BAT-2024-XYZ");

    std::cout << engine;
    std::cout << wheel;
    std::cout << accumulator;

    return 0;
}