// Да се реализира програма за представяне на UNO карти. 
// Всяка карта се определя със следните характеристики:

// Цифрови карти – съдържат число от 0 до 9 и цвят.
// Специални карти – имат цвят и действие от следните два вида:
// Skip – пропуска хода на следващия играч
// Reverse – обръща посоката на играта
// Карти за теглене – имат цвят и указват колко карти 
// трябва да изтегли следващият играч (4 или 6).
// Цветове: Всяка карта има един от следните цветове: червен, зелен, син, жълт.
// Функционалност: Да се реализира начин за извеждане на информация за всяка карта в 
// подходящ текстов формат.
// Да се реализира клас, който представя ръка от карти и поддържа операции за:

// Добавяне на карта - избиране на вид карта по случаен начин
// Премахване на карта - приема Цифрова карта и търси за карта от същия 
// цвят или цифра в ръката ни, ако няма се извиква добавяне на карта
// Извеждане на съдържанието на ръката
#include "exercise_02_card_deck.h"

int main() {
    CardDeck deck;

    for (size_t i = 0; i < 5; i++) {
        deck.addCard();
    }

    std::cout << "===== Deck =====" << std::endl;
    deck.printDeck();

    DigitCard toRemove(5, CardColor::Red);
    deck.removeCard(toRemove);

    std::cout << "===== Deck after removeCard =====" << std::endl;
    deck.printDeck();

    return 0;
}