// Разполагаме с В1 банкноти по 1лв., В2 – по 2лв. и В5 – 
// по 5лв. Да се състави програма, която въвежда от 
// клавиатурата последователно броя на банкнотите от 
// всеки вид – B1, B2, B5 и сума Р, и извежда на екрана 
// всички възможни начини, по които може да се представи 
// сумата Р лева с възможните банкноти.
#include <iostream>

int main() {
    int B1, B2, B5, P = 0;
    std::cin >> B1 >> B2 >> B5 >> P;

    std::cout << std::endl;
    for (size_t i = 0; i <= B1; i++) {
        for (size_t j = 0; j <= B2; j++) {
            for (size_t k = 0; k <= B5; k++) {
                if ((i * 1 + j * 2 + k * 5) == P) {
                    std::cout << "B1 = " << i << " * 1lv" << ", ";
                    std::cout << "B2 = " << j << " * 2lv" << ", ";
                    std::cout << "B5 = " << k << " * 5lv" << std::endl;
                }       
            }   
        }    
    }
    
    return 0;
}