// ЕЛЕКТРОНЕН ЧАСОВНИК
// В големия нов МОЛ в града на програмистите се 
// повредили част от цифрите на електронния часовник. 
// Повредени били първата цифра от числото, което показва часовете, 
// втората цифра на числото, което показва минутите и първата цифра 
// на числото, което показва секундите. Вместо тях на екрана се 
// появявал знака *. Когато Коко и приятелите му ходели на кино, 
// те не успявали да преценят точно колко е часа. Все пак, момчетата 
// си създали система за изчисление, която приблизително точно им 
// показвало времето. Те успявали да предвидят колко е показвал 
// часовника в началото и края на филма, в случай че знаят точно 
// колко време е минало. Срещу името на всеки филм на входа на киното 
// е дадено неговото времетраене в часове, минути и секунди. 
// Пресмятанията доста затрудняват момчетата и затова на тях ще им е 
// по-удобно това да се прави с компютърна програма. Те не разбират 
// много от програмиране и затова вие трябва да напишете програма 
// clock, която помага на Коко и приятелите му.
// Вход: На първия ред на стандартния вход е записана последователност 
// от цифри и знака *, която показва какво се вижда на екрана на 
// часовника в началото на филма. На втория ред е записана подобна 
// последователност за показанието на часовника в края на филма. 
// На третия ред се въвежда продължителността на филма в часове, 
// минути и секунди. Часовникът е настроен така, че показва времето 
// по 12-часова скала, а не по 24-часова.
// Изход: На стандартния изход изведете всички възможни показания на 
// часовника за началото и края на филма. Всяка двойка с начален и 
// краен час се извежда на един ред, като първо се извежда началното 
// показание във формат hh:mm:ss, и след един интервал крайното 
// показание в същия формат. Ако такива показания на часовника 
// не са възможни, да се изведе “Impossible”.
//Ограничения: Продължителността на филма е не по-голяма 12 часа.
#include <iostream>

int main() {
    char start[20], finish[20];
    std::cin >> start;
    std::cin >> finish;

    int h, m, s;
    std::cin >> h >> m >> s;
    int duration = h * 3600 + m * 60 + s;

    for (int sh = 1; sh <= 12; sh++) {
        for (int sm = 0; sm < 60; sm++) {
            for (int ss = 0; ss < 60; ss++) {
                
                int h1 = sh / 10;
                int h2 = sh % 10;
                int m1 = sm / 10;
                int m2 = sm % 10;
                int s1 = ss / 10;
                int s2 = ss % 10;
                bool ok = true;

                if (start[0] != '*' && start[0] - '0' != h1) {
                    ok = false;
                }
                
                if (start[1] != '*' && start[1] - '0' != h2) {
                    ok = false;
                }
                
                if (start[3] != '*' && start[3] - '0' != m1) {
                    ok = false;
                }

                if (start[4] != '*' && start[4] - '0' != m2) {
                    ok = false;
                }
                
                if (start[6] != '*' && start[6] - '0' != s1) {
                    ok = false;
                }

                if (start[7] != '*' && start[7] - '0' != s2) {
                    ok = false;
                }

                if (ok == false) {
                    continue;
                }

                int startSeconds = sh * 3600 + sm * 60 + ss;
                int endSeconds = startSeconds + duration;
                endSeconds = endSeconds % (12 * 3600);

                int eh = endSeconds / 3600;
                int rest = endSeconds % 3600;
                int em = rest / 60;
                int es = rest % 60;

                if (eh == 0) {
                    eh = 12;
                }

                int eh1 = eh / 10;
                int eh2 = eh % 10;

                int em1 = em / 10;
                int em2 = em % 10;

                int es1 = es / 10;
                int es2 = es % 10;
                ok = true;

                if (finish[0] != '*' && finish[0] - '0' != eh1) {
                    ok = false;
                }
                
                if (finish[1] != '*' && finish[1] - '0' != eh2) {
                    ok = false;
                }
                    
                if (finish[3] != '*' && finish[3] - '0' != em1) {
                    ok = false;
                }

                if (finish[4] != '*' && finish[4] - '0' != em2) {
                    ok = false;
                }

                if (finish[6] != '*' && finish[6] - '0' != es1) {
                    ok = false;
                }

                if (finish[7] != '*' && finish[7] - '0' != es2) {
                    ok = false;
                }

                if (ok) {
                    if (sh < 10) {
                        std::cout << "0";
                    }
                    std::cout << sh << ":";

                    if (sm < 10) {
                        std::cout << "0";
                    }
                    std::cout << sm << ":";

                    if (ss < 10) {
                        std::cout << "0";
                    }   
                    std::cout << ss;
                    std::cout << " ";
                
                    if (eh < 10) {
                        std::cout << "0";
                    }
                    std::cout << eh << ":";

                    if (em < 10) {
                        std::cout << "0";
                    }
                    std::cout << em << ":";

                    if (es < 10) {
                        std::cout << "0";
                    }
                    std::cout << es << std::endl;
                }
            }
        }
    }

    return 0;
}